GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c

//*******1*********2*********3*********4*********5*********6*********7**********
//
//                             board_STM32_spi.c
//
//
//  Common Logic for SPI support for STM32 MCUs.
//
//  Uses a combination of HAL_Library (mostly for configuration) and direct
//  register calls (main execution).
//
//  Specific chip dependences are mainly constrained to tables (GPIOs used
//  specific TIMx modules supported, etc). They are pulled in as #includes
//  based on MCU type.
//
//  In general, the use of #ifdefs within the code has been minimized, in
//  order to keep things read-able and maintainable.
//
//  History:
//    12/30/14 - Created for Industrial IoT OpenSource project.  Duq
//    07/30/15 - Reworked to provide better factoring. Worked first shot. Duq
//    08/09/15 - Tweaked Interrrupt Handling. Duquaine
//    08/10/15 - Set default to SPI_IO_BLOCKING because so much vendor code
//               depends upon blocking behavior. I do not have the time to
//               re-write all their code. Duq
//    10/17/15 - Ensure a minimal "spi timeout" value is set for SPI read/write
//               (in case user app forgets), otherwise get immediate timeouts. Duq
// -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
//
// The MIT License (MIT)
//
// Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
// 
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//******************************************************************************

#include "user_api.h"         // pull in high level User API defs
#include "device_config_common.h"     // device config stuff for SPI

#define  MAX_SPI_ID    100                // ??? !!  TWEAK THIS  WVD   !!! ???

typedef struct spi_gio_def                   /* SPI GPIO pin definitions */
    {
//      short        spi_api_id;             /* User API Logical SPI identifier*/
//      short        spi_module_id;          /* Associated SPI module index  */
//      GPIO_TypeDef *spi_SCLK_gpio_port;    /* Associated GPIO port         */
//      uint16_t     spi_SCLK_gpio_pin;      /* Associated GPIO pin          */

//      uint16_t     spi_SCLK_chan_alt_func; /* Channel Alternate Function Id*/

//      GPIO_TypeDef *spi_MISO_gpio_port;    /* Associated GPIO port         */
//      uint16_t     spi_MISO_gpio_pin;      /* Associated GPIO pin          */

//      uint16_t     spi_MISO_chan_alt_func; /* Channel Alternate Function Id*/

//      GPIO_TypeDef *spi_MOSI_gpio_port;    /* Associated GPIO port         */
//      uint16_t     spi_MOSI_gpio_pin;      /* Associated GPIO pin          */

//      uint16_t     spi_MOSI_chan_alt_func; /* Channel Alternate Function Id*/

        uint32_t     spi_chan_alt_func;     /* SPI Alternate Function Id     */
        int8_t       spi_pin_role;          /* acts in SCLK, MISO, or MOSI role*/
        uint8_t      spi_pin_number;        /* logical pin number 0-255      */
    } SPI_GPIO_BLK;

                    // valid values for spi_pin_role
#define  SCLK_PIN_ROLE   1
#define  MISO_PIN_ROLE   2
#define  MOSI_PIN_ROLE   3


typedef struct spi_io_block            /* SPI I/O Control Block (I/O Buffers) */
    {
        uint8_t      *spi_buffer;      /* Ptr to current spot in User I/O buf */
        uint16_t     spi_length;       /* Amount of data left to send/rcv     */
        uint8_t      spi_init;         /* 1 = module + clocks were initialized*/
        uint8_t      spi_state;        /* Current state of the SPI module     */
        uint8_t      spi_blocking;     /* 1 = I/O is blocking. Wait till I/O is
                                       **  complete before return to user app */
        uint8_t      spi_master_slave; /* 1 = Master, 2 = Slave               */
        uint8_t      spi_mode;         /* SPI Mode: 0, 1, 2, or 3             */
        int          spi_semaphore;    /* I/O wait semaphore                  */
        uint32_t     spi_max_timeout;  /* max time to wait for I/O (millisec) */
        uint32_t     spi_expiry_time;  /* timeout deadline for SPI I/O response */
     SPI_HandleTypeDef    *spi_handle; /* HAL SPI Handle to use for this I/O  */
     SPI_CB_EVENT_HANDLER spi_callback_handler;  /* optional callback routine */
        void         *spi_callback_parm;         /* user callback parm        */
    } SPI_IO_BUF_BLK;

                    // valid values for spi_state
#define  SPI_STATE_RESET            0   /* SPI is reset, not in use  */
#define  SPI_STATE_IO_PROCESSING    1   /* SPI I/O is in progress    */
#define  SPI_STATE_IO_PEND_COMPLETE 2   /* SPI I/O waiting for final complete */
#define  SPI_STATE_IO_COMPLETED     3   /* SPI I/O is fully complete */
#define  SPI_STATE_ERROR_COMPLETE   4   /* SPI I/O completed with an error */


void board_spi_enable_nvic_irq (int module_id);
void board_spi_stop_io (SPI_IO_BUF_BLK *ioblock);  // internal routines protos
int  board_spi_write_byte (SPI_IO_BUF_BLK *ioblock, uint8_t byte_Value);
int  board_spi_ALTFUNC_lookup (unsigned int module_id, int sclk_gpio_pin,
                               uint32_t *sclk_AltFuncId,
                               int miso_gpio_pin, uint32_t *miso_AltFuncId,
                               int mosi_gpio_pin, uint32_t *mosi_AltFuncId);


     //------------------------------------------------------------------------
     //
     // Pull in        MCU dependent GPIO / TIM tables and #defines
     //
     // The top of each module include key defines for:
     //          MAX_TIMERS,
     //          TMRPWM_NUM_MODULES
     //          TMRPWM_MAX_CHANNELS
     //
     // The following tables are pulled in:
     //          _g_timer_module_base[]       table/array
     //          _g_TIMx_TimPwmHandle's
     //          _g_timer_typedef_handle[]    table/array       was _g_timer_module_handle
     //          _g_TMPWM_IRQ_table[]         table/array
     //          _g_timer_base_channel_num[]  table/array
     //          _g_tmrpwm_mod_x_channels []  set of tables/arrays for GPIOs
     //          _g_tmrpwm_mod_channel_blk_lookup []    table/array
     //
     // Also, the following two utility routines are included in those files:
     //        - board_timerpwm_compute_prescalar()  because that is MCU speed
     //                                              and clock specific
     //        - board_timerpwm_enable_clock()       because which Timers are
     //                                              supported and the logic to
     //                                              start them is MCU specific
     //------------------------------------------------------------------------

#if defined(STM32F072xB) || defined(__STM32F072__)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_spi.c"
#define  MAX_SPI   2
#endif


#if defined(STM32F091xC) || defined(__STM32F091__)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_tables_F0_spi.c"
#define  MAX_SPI   2
#endif


#if defined(__STM32F103__) || defined(STM32F103xB)
//                                         STM32 - F103  Nucleo
#include "STM32_F1/board_F1_tables_spi.c"
#define  MAX_SPI   4
#endif


#if defined(STM32F303xC) || defined(STM32F303xE)
//                                         STM32 - F303  Nucleo and Discovery
#include "STM32_F3/board_F303_tables_spi.c"
#define  MAX_SPI   3
#endif


