GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo and Discovery
#include "STM32_F3/board_F334_tables_spi.c"
#define  MAX_SPI   1
#endif


#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
//                                         STM32 - F401/F411  Nucleos
#include "STM32_F4/board_F4x1_tables_spi.c"
#define  MAX_SPI   4
#endif

#if defined(STM32F446xx)
//                                         STM32 - F446  Nucleo
#include "STM32_F4/board_F446_tables_spi.c"
#define  MAX_SPI   4
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "STM32_F7/board_F7_tables_spi.c"
#define  MAX_SPI   6
#endif


#if defined(STM32L053xx)
//                                         STM32 - L053  Nucleo
#include "STM32_L0/board_L0_tables_spi.c"
#define  MAX_SPI   3
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo
#include "STM32_L1/board_L1_tables_spi.c"
#define  MAX_SPI   3
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Discovery/Nucleo
#include "STM32_L4/board_L4_tables_spi.c"
#define  MAX_SPI   3
#endif


//*****************************************************************************
//*****************************************************************************
//                      COMMON   TABLES and DEFINEs
//
//                                for
//
//                                SPI
//*****************************************************************************
//*****************************************************************************

#if (USES_BLUENRG_BLE)
extern    SPI_HandleTypeDef  SpiHandle;  // NOTE: ST's hci routines depend upon
                                         //    this hardcoded  SpiHandle  label.
                                         //    They have direct externs to it.
#endif


int  board_spi_enable_clock (int module_id);    // Prototypes for internal rtns

extern   const  int  _g_gpio_pull_flags[];      // defined in board_XX.c


//*****************************************************************************
//*****************************************************************************
//                               SPI   Routines
//*****************************************************************************
//*****************************************************************************

/*******************************************************************************
* board spi init function
*
*         Configures this MCU's SPI peripheral and its associated GPIOs.
*
*         The SPI Module Id specifies, both the SPI Module and the sub-variant
*         pins to use for that that module.
*
*         The module_id is split:
*             bottom low order 4 bits (0..3) = pin variant.
*             next nibble up (bits 4-7)      = actual SPI module number 0-5
*
*
*                SCLK     MISO     MOSI
*                ----     ----     ----
*         SPI1 = PA5   /  PA6   /  PA7
*           "    PB3   /  PB4   /  PB5    (alternate pin mode)
*         SPI2 = PB13  /  PC2   /  PC3
*           "    PB13  /  PB14  /  PB15   (alternate pin mode)
*         SPI3 = PC10  /  PC11  /  PC12
*           "    PB3   /  PB4   /  PB5    (alternate pin mode)
*
*  flags:   use_dma,   USES_BLUENRG_BLE, GPIO_OUT_PULLUP, GPIO_IN_PULL_UP/DOWN
*
* 07/31/15
*    Added option for user to pass in his own SPI_HandleTypeDef handle, instead
*    of using our internal one. This preserves some vendor SPI legacy code, that
*    have a very high dependency on using their own SPI_HandleTypeDef handle.
*******************************************************************************/

int  board_spi_init (unsigned int spi_module_id,
                     int sclk_pin_id, int miso_pin_id, int mosi_pin_id,
                     int master_slave, int spimode,
                     int baud_rate_scalar,  int flags,
                     SPI_HandleTypeDef *caller_hspi_ptr)     // extended support
{
    SPI_HandleTypeDef  *pSpiHdl;
    SPI_TypeDef        *spi_hwbase;
    SPI_IO_BUF_BLK     *ioblock;
    int                rc;
    int                idx;
    int                pull_flags_idx;
    int                sclk_pull_flags;
    int                miso_pull_flags;
    int                mosi_pull_flags;
    GPIO_TypeDef       *sclk_GPIO_port;    /* SCLK GPIO port   */
    uint32_t           sclk_GPIO_pin;      /* SCLK GPIO pin    */
    uint32_t           sclk_AltFuncId;     /* SCLK Alt Func Id (pin mux) */
    GPIO_TypeDef       *miso_GPIO_port;    /* MISO GPIO port   */
    uint32_t           miso_GPIO_pin;      /* MISO GPIO pin    */
    uint32_t           miso_AltFuncId;     /* MISO Alt Func Id (pin mux) */
    GPIO_TypeDef       *mosi_GPIO_port;    /* MOSI GPIO port   */
    uint32_t           mosi_GPIO_pin;      /* MOSI GPIO pin    */
    uint32_t           mosi_AltFuncId;     /* MOSI Alt Func Id (pin mux) */
    GPIO_InitTypeDef   GPIO_InitStruct;

    if (spi_module_id > MAX_SPI_ID)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

         //--------------------------------------------------------------
         // Get pointer to the SPI I/O Block to use for this module
         //--------------------------------------------------------------
    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];

         //---------------------------------------------------------------------
         // If module was already initialized - skip doing it again, and issue a warning
         //---------------------------------------------------------------------
    if (ioblock->spi_init)
       return (WARN_SPI_WAS_ALREADY_INITIALIZED);

       //---------------------------------------------------------------------
       // Get pointers to SPI MODULE Hardware base address, and TypeDef Handle
       //---------------------------------------------------------------------
    spi_hwbase = (SPI_TypeDef*) _g_spi_module_base [spi_module_id];
    pSpiHdl    = (SPI_HandleTypeDef*) _g_spi_typedef_handle [spi_module_id];

    if (caller_hspi_ptr != 0L)
       {   // caller wants to use _his_ SPI_TypeDef handle, not our internal one
         pSpiHdl = caller_hspi_ptr;                     // extended support
       }
    memset (pSpiHdl, 0, sizeof(SPI_HandleTypeDef));     // ensure is cleared out

