GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
       //---------------------------------------------------------------------
       // Locate associated GPIO Port and GPIO Pin for SCLK, MISO, MOSI pins
       //---------------------------------------------------------------------
    rc = board_gpio_pin_lookup (sclk_pin_id, &sclk_GPIO_port, &sclk_GPIO_pin);
    if (rc == 0)
       rc = board_gpio_pin_lookup (miso_pin_id, &miso_GPIO_port, &miso_GPIO_pin);
    if (rc == 0)
       rc = board_gpio_pin_lookup (mosi_pin_id, &mosi_GPIO_port, &mosi_GPIO_pin);
    if (rc != 0)
       return (rc);                  // invalid pin_id was given to us

       //---------------------------------------------------------------------
       // Locate the associated GPIO ALTERNATE_FUNCTION (AF) information.
       //---------------------------------------------------------------------
    rc = board_spi_ALTFUNC_lookup (spi_module_id, sclk_pin_id, &sclk_AltFuncId,
                                   miso_pin_id, &miso_AltFuncId,
                                   mosi_pin_id, &mosi_AltFuncId);
    if (rc != 0)
       return (rc);                  // pin_id not valid for this SPI instance

         //-----------------------------------------------------------------
         //           GPIO  Pin  Config  -  for SPI operation
         //
         // Setup the GPIO pins to operate in SPI mode  (pin muxing).
         // Configures SCLK, MISO, and MOSI.
         //-----------------------------------------------------------------
    pull_flags_idx  = (flags & 0x0003);                    // flags for SCLK
    sclk_pull_flags = _g_gpio_pull_flags[pull_flags_idx];
    pull_flags_idx  = ((flags & 0x000C) >> 2);             // flags for MISO
    miso_pull_flags = _g_gpio_pull_flags[pull_flags_idx];
    pull_flags_idx  = ((flags & 0x0030) >> 4);             // flags for MOSI
    mosi_pull_flags = _g_gpio_pull_flags[pull_flags_idx];

    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct)); // clear GPIO struct

#if defined(GPIO_SPEED_FAST)
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;   // Handle F0 vs F4 etc HAL inconsistencies
#else
    GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
#endif

    GPIO_InitStruct.Pin       = sclk_GPIO_pin;
    GPIO_InitStruct.Alternate = sclk_AltFuncId;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;      // Alt Func Push/Pull
    GPIO_InitStruct.Pull      = sclk_pull_flags;      // Blue NRG uses GPIO_PULLDOWN
    HAL_GPIO_Init (sclk_GPIO_port, &GPIO_InitStruct); // Setup SCLK pin

    GPIO_InitStruct.Pin       = miso_GPIO_pin;
    GPIO_InitStruct.Alternate = miso_AltFuncId;
    GPIO_InitStruct.Pull      = miso_pull_flags;      // Blue NRG uses GPIO_PULLUP
    HAL_GPIO_Init (miso_GPIO_port, &GPIO_InitStruct); // Setup MOSI pin

    GPIO_InitStruct.Pin       = mosi_GPIO_pin;
    GPIO_InitStruct.Alternate = mosi_AltFuncId;
    GPIO_InitStruct.Pull      = mosi_pull_flags;      // Blue NRG uses GPIO_PULLUP
    HAL_GPIO_Init (mosi_GPIO_port, &GPIO_InitStruct); // Setup MOSI pin

#if defined(USE_DMA)
         //----------------------------------------
         //    SPI2  DMA and Interrupts  Enable
         //----------------------------------------
    board_spi_dma_init();
    HAL_NVIC_SetPriority (SPI2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ (SPI2_IRQn);
#endif

       //---------------------------------------------------------------------
       // Initialize the SPI MODULE I/O Block
       //---------------------------------------------------------------------
    memset (ioblock, 0, sizeof(SPI_IO_BUF_BLK));   // ensure is cleared out
    ioblock->spi_init   = 1;                       // tag it as been initialized
    ioblock->spi_state  = SPI_STATE_RESET;         // set to initial state

    ioblock->spi_max_timeout = 100;                // ensure minial SPI timeout

    ioblock->spi_master_slave = master_slave;      // save type and mode
    ioblock->spi_mode         = spimode;
    ioblock->spi_handle = pSpiHdl; // Save the SPI handle to use during I/O processing

         //--------------------------------------------------------------
         // Turn on the clock for the physical SPI module
         //--------------------------------------------------------------
    board_spi_enable_clock (spi_module_id);

         //------------------------------------------------------------
         //                      SPI Module Config
         //
         //          Setup HAL info needed for SPI Configuration
         //------------------------------------------------------------
    pSpiHdl->Instance             = spi_hwbase;  // set assoc SPI HW module in HAL TypeDef
    pSpiHdl->Init.Mode            = SPI_MODE_MASTER;
    pSpiHdl->Init.Direction       = SPI_DIRECTION_2LINES;
    pSpiHdl->Init.DataSize        = SPI_DATASIZE_8BIT;
    if (spimode == 0)
      { pSpiHdl->Init.CLKPolarity = SPI_POLARITY_LOW;
        pSpiHdl->Init.CLKPhase    = SPI_PHASE_1EDGE;
      }
     else if (spimode == 1)
      { pSpiHdl->Init.CLKPolarity = SPI_POLARITY_HIGH;
        pSpiHdl->Init.CLKPhase    = SPI_PHASE_1EDGE;
      }
     else if (spimode == 2)
      { pSpiHdl->Init.CLKPolarity = SPI_POLARITY_LOW;  // CPOL = 0, CPHA = 1
        pSpiHdl->Init.CLKPhase    = SPI_PHASE_2EDGE;
      }
     else if (spimode == 3)
      { pSpiHdl->Init.CLKPolarity = SPI_POLARITY_HIGH; //EASY_SPIN, PRESCALE = 32
        pSpiHdl->Init.CLKPhase    = SPI_PHASE_2EDGE;   //Ada ST7735 LCD SCALE = 8
      }
    pSpiHdl->Init.NSS             = SPI_NSS_SOFT;
    pSpiHdl->Init.FirstBit        = SPI_FIRSTBIT_MSB;
    pSpiHdl->Init.CRCPolynomial   = 7;
    pSpiHdl->Init.CRCCalculation  = SPI_CRCCALCULATION_DISABLED;
    pSpiHdl->Init.TIMode          = SPI_TIMODE_DISABLED;

       //----------------------------------------------------------------------
       // This is literally a pre-scaler value. It only indirectly sets the SPI baud rate.
       // PCLK2 max frequency is 100 MHz.  BAUD = PCLK2/SPI_BaudRatePrescaler.
       //
       // That's just the way ST's "baud rate generation" works. It's just a
       // prescalar off of a system clock. No fine grain, separate, baud generator.
       //----------------------------------------------------------------------
    pSpiHdl->Init.BaudRatePrescaler = baud_rate_scalar;

    rc = HAL_SPI_Init (pSpiHdl);       // go intialize the SPI module

    __HAL_SPI_ENABLE (pSpiHdl);   // turn on SPI Enable flag SPI_CR1_SPE in CR1

    if (flags & SPI_IO_NON_BLOCKING)
       {       // que I/O and return to caller
         ioblock->spi_blocking = 0;
         board_spi_enable_nvic_irq (spi_module_id);   // turn on interrupts
       }
      else {   // We must block on return of Read/Write calls until I/O complete
             ioblock->spi_blocking = 1;               // turn on blocking mode
           }

