GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
    if (rc != HAL_OK)
       return (-1);             // denote SPI init failed
    return (0);                 // denote it worked OK
}


//--------------------------------------------------------------
//                FUTURE  -   DMA  Support
//--------------------------------------------------------------
                                  /* Definition for SPIx clock resources */
#define DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
/* Definition for SPIx's DMA */
#define SPIx_TX_DMA_CHANNEL              DMA_CHANNEL_0
#define SPIx_TX_DMA_STREAM               DMA1_Stream4
#define SPIx_RX_DMA_CHANNEL              DMA_CHANNEL_0
#define SPIx_RX_DMA_STREAM               DMA1_Stream3

/* Definition for SPIx's NVIC */
#define SPIx_DMA_TX_IRQn                 DMA1_Stream4_IRQn
#define SPIx_DMA_RX_IRQn                 DMA1_Stream3_IRQn
#define SPIx_DMA_TX_IRQHandler           DMA1_Stream4_IRQHandler
#define SPIx_DMA_RX_IRQHandler           DMA1_Stream3_IRQHandler

#if defined(USE_DMA)
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;
  DMAx_CLK_ENABLE();

  /* Configure the DMA handler for Transmission process */
  hdma_tx.Instance                 = SPIx_TX_DMA_STREAM;

  hdma_tx.Init.Channel             = SPIx_TX_DMA_CHANNEL;
  hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_tx.Init.Mode                = DMA_NORMAL;
  hdma_tx.Init.Priority            = DMA_PRIORITY_LOW;
  hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_tx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_tx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_tx);

      /* Associate the initialized DMA handle to the the SPI handle */
  __HAL_LINKDMA (hspi, hdmatx, hdma_tx);

      /* Configure the DMA handler for Transmission process */
  hdma_rx.Instance                 = SPIx_RX_DMA_STREAM;

  hdma_rx.Init.Channel             = SPIx_RX_DMA_CHANNEL;
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_rx.Init.Mode                = DMA_NORMAL;
  hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
  hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_rx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_rx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_rx);

      /* Associate the initialized DMA handle to the the SPI handle */
  __HAL_LINKDMA (hspi, hdmarx, hdma_rx);

      /*##-4- Configure the NVIC for DMA #########################################*/
      /* NVIC configuration for DMA transfer complete interrupt (SPI3_TX) */
  HAL_NVIC_SetPriority (SPIx_DMA_TX_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ (SPIx_DMA_TX_IRQn);

      /* NVIC configuration for DMA transfer complete interrupt (SPI3_RX) */
  HAL_NVIC_SetPriority (SPIx_DMA_RX_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ (SPIx_DMA_RX_IRQn);
#endif                                        //  #if defined(USE_DMA)

#if defined(USE_DMA)
              //------------------------------------------
              // DMA init for SPI RX and TX directions
              //------------------------------------------
           _g_hdma_spi2_rx.Instance                 = DMA1_Channel4;    // RX
           _g_hdma_spi2_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
           _g_hdma_spi2_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_rx.Init.MemInc              = DMA_MINC_DISABLE; // ISSUE ???
           _g_hdma_spi2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_rx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_rx);

           __HAL_LINKDMA (&_g_hspi2, hdmarx, _g_hdma_spi2_rx);

           _g_hdma_spi2_tx.Instance                 = DMA1_Channel5;  // TX
           _g_hdma_spi2_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
           _g_hdma_spi2_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_tx.Init.MemInc              = DMA_MINC_ENABLE;
           _g_hdma_spi2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_tx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_tx);

           __HAL_LINKDMA (&_g_hspi2, hdmatx, _g_hdma_spi2_tx);
#endif                            // defined(USE_DMA)




/*******************************************************************************
* Enable DMA controller clock and initialize DMA Interrupts
*******************************************************************************/
void  board_spi_dma_init (void)
{
#if defined(DMA_ENABLED)
    __DMA1_CLK_ENABLE();               // DMA controller clock enable

        //--------------------------------------------
        //    DMA interrupts init
        //--------------------------------------------
    HAL_NVIC_SetPriority (DMA1_Channel4_IRQn, 0, 0);   // SPI RX
    HAL_NVIC_EnableIRQ (DMA1_Channel4_IRQn);
    HAL_NVIC_SetPriority (DMA1_Channel5_IRQn, 0, 0);   // SPI TX
    HAL_NVIC_EnableIRQ (DMA1_Channel5_IRQn);
#endif
}


//******************************************************************************
//  board_spi_ALTFUNC_lookup
//
//        Finds/scans for the associated SCLK/MISO/MOSI GPIO Pin's
//        associated ALTERNATE FUNCTION (AF) information.
//        Returns the ALTERNATE_FUNCTION (AF) id for each pin.
//******************************************************************************

