GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
int  board_spi_ALTFUNC_lookup (unsigned int module_id, int sclk_gpio_pin, uint32_t *sclk_AltFuncId,
                               int miso_gpio_pin, uint32_t *miso_AltFuncId,
                               int mosi_gpio_pin, uint32_t *mosi_AltFuncId)
{
    SPI_GPIO_BLK   *gpio_blk_base;
    SPI_GPIO_BLK   *gpio_curr_ptr;

    gpio_blk_base = (SPI_GPIO_BLK*) _g_spi_gpio_table_addr [module_id];
    if (gpio_blk_base == 0L)
       return (ERR_SPI_MODULE_NUM_NOT_SUPPORTED);

    *sclk_AltFuncId = 0xFFFF;      // initially clear out the entries
    *miso_AltFuncId = 0xFFFF;
    *mosi_AltFuncId = 0xFFFF;

       // first, scan to locate the associated SCLK pin support in the table
    gpio_curr_ptr = gpio_blk_base;
    while (gpio_curr_ptr->spi_pin_role != -1)
      { if (gpio_curr_ptr->spi_pin_number == sclk_gpio_pin)
           { if (gpio_curr_ptr->spi_pin_role == SCLK_PIN_ROLE)
                { *sclk_AltFuncId = gpio_curr_ptr->spi_chan_alt_func;  // pass back associated Alternate Function Id
                  break;                     // we found desired pin. bail out
                }
           }
        gpio_curr_ptr++;                     // else step to the next entry
      }

       // then, scan to locate the associated MISO pin support in the table
    gpio_curr_ptr = gpio_blk_base;
    while (gpio_curr_ptr->spi_pin_role != -1)
      { if (gpio_curr_ptr->spi_pin_number == miso_gpio_pin)
           { if (gpio_curr_ptr->spi_pin_role == MISO_PIN_ROLE)
                { *miso_AltFuncId = gpio_curr_ptr->spi_chan_alt_func;  // pass back associated Alternate Function Id
                  break;                     // we found desired pin. bail out
                }
           }
        gpio_curr_ptr++;                     // else step to the next entry
      }

       // finally, scan to locate the associated MOSI pin support in the table
    gpio_curr_ptr = gpio_blk_base;
    while (gpio_curr_ptr->spi_pin_role != -1)
      { if (gpio_curr_ptr->spi_pin_number == mosi_gpio_pin)
           { if (gpio_curr_ptr->spi_pin_role == MOSI_PIN_ROLE)
                { *mosi_AltFuncId = gpio_curr_ptr->spi_chan_alt_func;  // pass back associated Alternate Function Id
                  break;                     // we found desired pin. bail out
                }
           }
        gpio_curr_ptr++;                     // else step to the next entry
      }

    if (*sclk_AltFuncId == 0xFFFF || *miso_AltFuncId == 0xFFFF || *mosi_AltFuncId == 0xFFFF)
       return (ERR_SPI_PIN_ID_NOT_SUPPORTED);   // no match found in table

    return (0);                // denote operation completed successfully
}


//******************************************************************************
// board_spi_check_io_completed
//
//          Check if I/O has completed.
//
//          Flags:    SPI_WAIT_FOR_COMPLETE  -  wait till I/O is complete.
//
//          Returns:
//              True  (1) = Completed
//              False (0) = Busy
//                    -1  = completed with error
//******************************************************************************
int  board_spi_check_io_completed (unsigned int spi_module_id, int flags)
{
    SPI_IO_BUF_BLK  *ioblock;

    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

    if (ioblock->spi_state == SPI_STATE_IO_PROCESSING)
       { if ((flags & SPI_WAIT_FOR_COMPLETE) == 0)
            return (0);                   // I/O still busy

             //-----------------------------------------------------------------
             // caller has requested: SPI_WAIT_FOR_COMPLETE.
             //
             // for Low Power or RTOS versions we would do a wait, until
             // the I/O interrupts completed.
             //-----------------------------------------------------------------
//       IO_SEMAPHORE_SET (ioblock->spi_semaphore);
         IO_SEMAPHORE_WAIT (&ioblock->spi_semaphore);  // go into LPM or RTOS proc switch --> See CC3100 LOGIC
       }

    if (ioblock->spi_state == SPI_STATE_ERROR_COMPLETE)
       return (-1);                      // I/O Completed with error

    return (1);                          // I/O Completed successfully
}


//*****************************************************************************
//  board_spi_get_handle
//
//             debugging hook used during board bring up to test new MCUs SPI.
//*****************************************************************************

SPI_HandleTypeDef *board_spi_get_handle (unsigned int spi_module_id)
{
    SPI_HandleTypeDef  *pSpiHdl;

             // get assoc SPI HAL Handle we are using
    pSpiHdl = (SPI_HandleTypeDef*) _g_spi_typedef_handle [spi_module_id];

    return (pSpiHdl);               // return HAL related SPI handle
}


//*****************************************************************************
//  board_spi_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when any SPI interrupt completion (or terminating error) occurs.
//*****************************************************************************
int  board_spi_set_callback (unsigned int spi_module_id,
                             SPI_CB_EVENT_HANDLER callback_function,
                             void *callback_parm)
{
    SPI_IO_BUF_BLK  *ioblock;

    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);
    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

       //-------------------------------------------------------------------
       // Save any call back information, for interrupts
       //-------------------------------------------------------------------

    ioblock->spi_callback_handler = callback_function;  // save callback info
    ioblock->spi_callback_parm    = callback_parm;

    return (0);                        // denote completed OK
}


//*****************************************************************************
//  board_spi_set_max_timeout
//
//          Set the maximum time that the MCU should wait for an SPI
//          send/receive transaction to complete.
//          If it exceeds this value, signal an error, and cancel the I/O
//          that was in progress.
//
// NOTE THAT WITH ST code, TIMEOUTs are _only_ used with Polled I/O.
//      Are _NOT_ used with Interrupt or DMA driven I/O  !!!
//*****************************************************************************
int  board_spi_set_max_timeout (unsigned int spi_module_id, uint32_t max_timeout)
{
    SPI_IO_BUF_BLK  *ioblock;

    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

    ioblock->spi_max_timeout = max_timeout;  // save Max Timeout value

    return (0);                        // denote completed OK
}


//*****************************************************************************
//  board_spi_stop_io
//
//          An SPI I/O call (read/write/write_read) timed out.
//          Terminate any I/O in progress and reset back to start a new operation.
//
// NOTE THAT WITH ST code, TIMEOUTs are _only_ used with Polled I/O.
//      Are _NOT_ used with Interrupt or DMA driven I/O  !!!
//*****************************************************************************
void  board_spi_stop_io (SPI_IO_BUF_BLK *ioblock)
{
        // ??? CALL HAL IF WE ARE USING HAL for I/O
        // ??? HOW STOP AN SPI OPERATION ?   MUST IT BE RESET BACK LIKE INIT ?

        /* Disable TXE, RXNE and ERR interrupts when using interrupt process */
/// __HAL_SPI_DISABLE_IT (ioblock->spi_handle, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

    __HAL_SPI_DISABLE(ioblock->spi_handle);  // issue SPI disable to stop I/O

    ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;  // set our state


//   ??? !!!   Issue error callback to the user    ??? !!!


