GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
    __HAL_SPI_ENABLE(ioblock->spi_handle);   // then re-anble SPI for new I/O
}



//*****************************************************************************
//  board_spi_read
//
//           derived from:    EasySpin  SPI   I/O   Routine
//
// @brief  Sets the registers of the EasySpin to their predefined values
//         from easyspin_target_config.h
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************

int  board_spi_read (unsigned int spi_module_id, uint8_t *receive_buffer,
                     int max_buf_length, int flags)
{
    SPI_IO_BUF_BLK     *ioblock;
    SPI_HandleTypeDef  *pSpiHdl;
    SPI_TypeDef        *spibase;
    int                rc;

       // extract the actual SPI module from the encoded version of spi_module_id
    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

    pSpiHdl   = ioblock->spi_handle;           // get associated HAL handle
    if (ioblock->spi_state == SPI_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);  // still working on a previous I/O

    ioblock->spi_buffer = receive_buffer;    // save ptr to User I/O buf
    ioblock->spi_length = max_buf_length;    // save amount of data to rcv
    ioblock->spi_expiry_time = ioblock->spi_max_timeout;   // set any max timeout

    ioblock->spi_state = SPI_STATE_IO_PROCESSING; // denote I/O is now in progress

// for now, issue HAL Send calls.  In future, low level equivalent   ??? !!! WVD

    spibase = (SPI_TypeDef*) pSpiHdl->Instance;     // Point to SPI peripheral HW
    if (ioblock->spi_blocking)
       {      // BLOCKING I/O - wait until I/O is complete, before return to app
//       if (ioblock->spi_mode == SPI_SLAVE)
//          { spibase->DR = (*transmit_buffer);     // load a byte of data
//            buf_length--;
//          }
         while (max_buf_length > 0)
            {     // wait until see TXE (TX buffer empty) before send next byte

// ??? add timeout logic
// tickstart = HAL_GetTick();
// if (ioblock->spi_max_timeout > 0)
//    tickend = tickstart + ioblock->spi_max_timeout;
//    else tickend > 0;
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_TXE) == RESET)  // wait till get TX empty
                {
//                if (_g_systick_millisecs > tickend && tickend != 0)   // WRAP_AROUND ISSUE
//                   break - timeout;
                }
              spibase->DR = 0xAA;                  // send a dummy byte of data
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET) ; // wait till get RX rcvd
              *receive_buffer++ = spibase->DR;    // read and save rcvd SPI byte
              max_buf_length--;                   // deduct amount left
            }
///      while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET) ; // wait till get last RX rcvd  ??? IS THIS FINAL RCV NEEDED (or TX if SLAVE) ???
///      *receive_buffer++ = spibase->DR;          // read + save any final SPI rcvd byte
         ioblock->spi_state = SPI_STATE_IO_COMPLETED;   // Tag as successful I/O
         rc = HAL_OK;
//       rc = HAL_SPI_Receive (ioblock->spi_handle,
//                             receive_buffer, max_buf_length,
//                             ioblock->spi_max_timeout); // ST timeout ONLY used in Poll mode
         if (rc == HAL_OK)
            {
//            rc = OS_WAIT (ioblock->spi_expiry_time); // Wait for the I/O to complete
//            if (rc != 0)
//               board_spi_stop_io (ioblock); // I/O timed out. Stop any I/O call in progress
              ioblock->spi_state = SPI_STATE_IO_COMPLETED;  // Tag as successful I/O
            }
       }
      else {    // NON-BLOCKING I/O - schedule it, then return to user app.
             rc = HAL_SPI_Receive_IT (ioblock->spi_handle,
                                      receive_buffer,
                                      max_buf_length);
           }

    if (rc != HAL_OK)
       { ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;
         return (-1);
       }

    return (0);        // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//*****************************************************************************

int  board_spi_write (unsigned int spi_module_id, uint8_t *transmit_buffer,
                      int buf_length, int flags)
{
    SPI_IO_BUF_BLK     *ioblock;
    SPI_HandleTypeDef  *pSpiHdl;
    SPI_TypeDef        *spibase;
    int                rc;
    uint32_t           tickstart,  tickend;
    uint8_t            dummy;

    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

    pSpiHdl   = ioblock->spi_handle;            // get associated HAL handle
    if (ioblock->spi_state == SPI_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

    ioblock->spi_buffer = transmit_buffer;    // save ptr to User I/O buf
    ioblock->spi_length = buf_length;         // save amount of data to send
    ioblock->spi_expiry_time = ioblock->spi_max_timeout;   // set any max timeout

    ioblock->spi_state = SPI_STATE_IO_PROCESSING; // denote I/O is now in progress


// for now, issue HAL Send calls.  In future, low level equivalent   ??? !!! WVD

    spibase = (SPI_TypeDef*) pSpiHdl->Instance;     // Point to SPI peripheral HW
    if (ioblock->spi_blocking)
       {        // BLOCKING I/O - wait until operation is complete, before return to app
//       if (ioblock->spi_mode == SPI_SLAVE)
//          { spibase->DR = (*transmit_buffer);     // load a byte of data
//            buf_length--;
//          }
#if BROKEN_2015_08_10
         while (buf_length > 0)
            {     // wait until see TXE (TX buffer empty) before send next byte

// ??? add timeout logic
// tickstart = HAL_GetTick();
// if (ioblock->spi_max_timeout > 0)
//    tickend = tickstart + ioblock->spi_max_timeout;
//    else tickend > 0;
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_TXE) == RESET)     // wait till get TX empty
                {
//                if (_g_systick_millisecs > tickend && tickend != 0)   // WRAP_AROUND ISSUE
//                   break - timeout;
                }
              spibase->DR = (*transmit_buffer++);   // send a byte of data
              buf_length--;                         // deduct amount left
// 08/10/15 - HANGS IN HERE - TILT !!!
// Is this another FIFO screw-over ???  -  What is the trick to get turn them off ?
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET) ; // wait till get last RX rcvd
              dummy = spibase->DR;                  // read and discard any final SPI rcvd byte
            }
         while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET) ; // wait till get last RX rcvd
///      while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_BSY) == RESET) ;  // wait till get SPI Transmit/Rcv complete (Not as reliable)
         dummy = spibase->DR;                       // read and discard any final SPI rcvd byte
         rc = HAL_OK;
#else
         rc = HAL_SPI_Transmit (ioblock->spi_handle,
                                transmit_buffer, buf_length,
                                ioblock->spi_max_timeout); // ST timeout ONLY used in Poll mode
#endif
         if (rc == HAL_OK)
            {
//            rc = OS_WAIT (ioblock->spi_expiry_time); // Wait for the I/O to complete
//            if (rc != 0)
//               board_spi_stop_io (ioblock); // I/O timed out. Stop any I/O call in progress
              ioblock->spi_state = SPI_STATE_IO_COMPLETED;  // Tag as successful I/O
            }
       }

      else {    // NON-BLOCKING I/O - schedule it, then return to user app.
             rc = HAL_SPI_Transmit_IT (ioblock->spi_handle,
                                       transmit_buffer,
                                       buf_length);
           }

