GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
    if (rc != HAL_OK)
       { ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;
         return (-1);
       }

    return (0);        // tell user it was started (Non-Block) or completed OK
}


//*****************************************************************************
//  board_spi_write_read
//
// @brief  Sets the registers of the EasySpin to their predefined values
//         from easyspin_target_config.h
// @param[in] pByteToTransmit pointer to the byte to transmit
// @param[in] pReceivedByte pointer to the received byte
// @retval    None
//*****************************************************************************
#if defined(SPIRIT1_ST_SHIELD)
#define RADIO_SPI_TIMEOUT_MAX                   ((uint32_t)1000)

      extern  SPI_HandleTypeDef   pSpiHandle;           // ORIGINAL SPIRIT1 code
              HAL_StatusTypeDef  status = HAL_OK;       // ORIGINAL CODE
      extern  uint32_t           SpiTimeout; // = RADIO_SPI_TIMEOUT_MAX;   /* Value of Timeout when SPI communication fails */
              uint8_t            Value;
#endif

int  board_spi_write_read (unsigned int spi_module_id, uint8_t *transmit_buffer,
                           uint8_t *receive_buffer, int buf_length,
                           int flags)
{
    SPI_IO_BUF_BLK     *ioblock;
    SPI_HandleTypeDef  *pSpiHdl;
    SPI_TypeDef        *spibase;
    uint32_t           tickstart,  tickend;
    int                rc;

       // extract the actual SPI module from the encoded version of spi_module_id
    if (spi_module_id > MAX_SPI)
       return (ERR_SPI_NUM_OUT_OF_RANGE);

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_module_id];  // get assoc I/O block

    pSpiHdl   = ioblock->spi_handle;            // get associated HAL handle
    if (ioblock->spi_state == SPI_STATE_IO_PROCESSING)
       return (ERR_IO_ALREADY_IN_PROGRESS);   // still working on a previous I/O

    ioblock->spi_buffer = transmit_buffer;    // save ptr to User I/O buf
    ioblock->spi_length = buf_length;         // save amount of data to send
    ioblock->spi_expiry_time = ioblock->spi_max_timeout;   // set any max timeout

    ioblock->spi_state = SPI_STATE_IO_PROCESSING; // denote I/O is now in progress

// for now, issue HAL Send calls.  In future, low level equivalent   ??? !!! WVD
#if defined(_RXNE_IS_HANGING)          // F3 02 and F3 34
//#if defined(STM32F302x8) || defined(STM32F334x8)          // F3 02 and F3 34
    while ((hspi_w5200.Instance->SR & SPI_FLAG_TXE) == RESET) ;
//  while (SPI_I2S_GetFlagStatus(SPI_MODULE, SPI_I2S_FLAG_TXE) == RESET) ;
//  if ((hspi->Instance->SR & SPI_FLAG_TXE) == SPI_FLAG_TXE)

    hspi_w5200.Instance->DR = data_byte;
//  SPI_SendData8 (SPI_MODULE, data_byte);
//  hspi->Instance->DR = *((uint16_t*) hspi->pTxBuffPtr);

    while ((hspi_w5200.Instance->SR & SPI_FLAG_RXNE) == RESET) ;
/// while (SPI_I2S_GetFlagStatus(SPI_MODULE, SPI_I2S_FLAG_RXNE) == RESET) ;
//  if ((hspi->Instance->SR & SPI_FLAG_RXNE) == SPI_FLAG_RXNE)

         // EasySpin debug lesson:
         //        for 1 byte I/O, the reply byte is in H.O of halfword !!!
         //        xic = 0x0055   dic = 0x5500  !!!   ==> shift needed

    rcvd_char = hspi_w5200.Instance->DR;
    return (rcvd_char);
//  return SPI_ReceiveData8 (SPI_MODULE);
//  *((uint16_t*) hspi->pRxBuffPtr) = hspi->Instance->DR;
#endif

    spibase = (SPI_TypeDef*) pSpiHdl->Instance;     // Point to SPI peripheral HW
    if (ioblock->spi_blocking)
       {      //----------------------------------------------------------------
              // BLOCKING I/O - wait until I/O is complete, before return to app
              //----------------------------------------------------------------
//#if defined(SPIRIT1_ST_SHIELD)
              //-----------------------------------------------------------------------------------------
              //  09/11/15 the following logic works for W5200 and L6474, but fails for Spirit1.  WTF !!!
              //-----------------------------------------------------------------------------------------
//       if (ioblock->spi_mode == SPI_SLAVE)
//          { spibase->DR = (*transmit_buffer);     // load a byte of data
//            buf_length--;
//          }
         while (buf_length > 0)
            {     // wait until see TXE (TX buffer empty) before send next byte

// ??? add timeout logic
// tickstart = HAL_GetTick();
// if (ioblock->spi_max_timeout > 0)
//    tickend = tickstart + ioblock->spi_max_timeout;
//    else tickend > 0;
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_TXE) == RESET)  // wait till get TX empty
                {
//                if (_g_systick_millisecs > tickend && tickend != 0)   // WRAP_AROUND ISSUE
//                   break - timeout;
                }
              spibase->DR = (*transmit_buffer++);  // send a byte of data
              while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET)
                 ;                   // wait till get RX rcvd  <------  09/11/15 HANGS FOREVER ON THIS.  Verify spibase is correct !
              *receive_buffer++ = spibase->DR;    // read and save rcvd SPI byte
              buf_length--;                       // deduct amount left
            }
///      while (__HAL_SPI_GET_FLAG(pSpiHdl, SPI_FLAG_RXNE) == RESET) ; // wait till get last RX rcvd  ??? IS THIS FINAL RCV NEEDED (or TX if SLAVE) ???
///      *receive_buffer++ = spibase->DR;          // read + save any final SPI rcvd byte
         rc = HAL_OK;
//#else
#if BADLY_BROKEN_ST_CODE
   Value = *transmit_buffer;
            //--------------------------------------------------
            //                ORIGINAL  ST  CODE  - THIS IS HORRIBLY BROKEN !!!
            //--------------------------------------------------
// while (__HAL_SPI_GET_FLAG(&pSpiHandle, SPI_FLAG_TXE) == RESET)
     ;                                        // wait till SPI TX buffer is free
// status = HAL_SPI_Transmit (&pSpiHandle, (uint8_t*) &Value, 1, SpiTimeout);

  while (__HAL_SPI_GET_FLAG(pSpiHdl , SPI_FLAG_TXE) == RESET)
     ;                                        // wait till SPI TX buffer is free
   status = HAL_SPI_Transmit (pSpiHdl, (uint8_t*) &Value, 1, SpiTimeout);

