GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_spi.c
      /* Check the communication status */
  if (status != HAL_OK)
     {
            /* Execute user timeout callback */
    // SPI_Error();
       ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;
       return (-1);
     }

#endif
         ioblock->spi_state = SPI_STATE_IO_COMPLETED;   // Tag as successful I/O
       }
      else {    // NON-BLOCKING I/O - schedule it, then return to user app.
             rc = HAL_SPI_TransmitReceive_IT (ioblock->spi_handle,
                                              transmit_buffer,
                                              receive_buffer,
                                              buf_length);
           }

    if (rc != HAL_OK)
       { ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;
         return (-1);
       }

    return (0);        // tell user it was started (Non-Block) or completed OK
}


   extern    int   rupt_module_id;            // TEMP_HACK


/*************************************************************************
*                                 TEMP  ISR   HACK
* @brief  SPI error callbacks.
* @param  hspi: SPI handle
*
* @note   This example shows a simple way to report transfer error,
*         and you canadd your own implementation.
* @retval None
*/
void HAL_SPI_ErrorCallback (SPI_HandleTypeDef *hspi)
{
    SPI_IO_BUF_BLK     *ioblock;

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [rupt_module_id];    // get assoc I/O block
    ioblock->spi_state = SPI_STATE_ERROR_COMPLETE;   // set ending status

    if (ioblock->spi_callback_handler != 0L)
       {             // Invoke user callback for the interrupt
         (ioblock->spi_callback_handler) (ioblock->spi_callback_parm,
                                          rupt_module_id, -1);     // signal error
       }
}


/************************************************************************
*                                 TEMP  ISR   HACK
*
* @brief  TxRx Transfer completed callback.
* @param  hspi: SPI handle.
*
* @note   This example shows a simple way to report end of
*         Interrupt TxRx transfer, and
*         you can add your own implementation.
* @retval None
*/
void  HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    SPI_IO_BUF_BLK     *ioblock;

    ioblock = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [rupt_module_id];    // get assoc I/O block
    ioblock->spi_state = SPI_STATE_IO_COMPLETED;  // Tag as successful I/O

    if (ioblock->spi_callback_handler != 0L)
       {             // Invoke user callback for the interrupt
         (ioblock->spi_callback_handler) (ioblock->spi_callback_parm,
                                          rupt_module_id, 0);   // signal good completion
       }
}


//******************************************************************************
//                     COMMON    SPI     ISR / IRQ     Handler
//
// The spi_interrupt_number ranges from 1 to n, and it indicates which
// SPIx_IRQHandler invoked us: e.g. 1 = SPI1_IRQHandler, 2 = SPI2_IRQHandler.
// The handler is directly tied to the SPI modules SPI1, SPI2, ...
//******************************************************************************
    int   rupt_module_id = 0;            // TEMP_HACK

void  board_spi_IRQ_Handler (int spi_interrupt_number)
{
    SPI_IO_BUF_BLK  *ioblk;

    rupt_module_id = spi_interrupt_number;

    ioblk = (SPI_IO_BUF_BLK*) _g_spi_io_blk_address [spi_interrupt_number];

    IO_SEMAPHORE_RELEASE (&ioblk->spi_semaphore);  // clear any semaphore

    HAL_SPI_IRQHandler (ioblk->spi_handle);            // initial pass
}

/******************************************************************************/
